Catalogs/СохраненныеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СохраненныеНастройки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНастройки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНастроек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастраиваемыйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриОткрытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьПриЗапуске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравоИзменения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНастроек</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НастройкиОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеНастройкиОтчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастрокиФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастройкиПользователяНастройкиОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныеНастройки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СохраненныеНастройки/Forms/ФормаВыбораУправляемая/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    Если Параметры.Свойство("РежимСохраненияНастройки") Тогда
		РежимСохраненияНастройки  = Параметры.РежимСохраненияНастройки;
	КонецЕсли;
    Если Параметры.Свойство("НастраиваемыйОбъект") Тогда
		НастраиваемыйОбъект  = Параметры.НастраиваемыйОбъект;
	КонецЕсли;
	// Установка заголовка формы и удаление ненужных кнопок панели
	ИмяОбъекта = Сред(НастраиваемыйОбъект, Найти(НастраиваемыйОбъект, ".") + 1);
	Если Параметры.Свойство("Заголовок") Тогда
		СинонимОбъекта = Параметры.Заголовок;
	ИначеЕсли Метаданные.Отчеты.Найти(ИмяОбъекта) <> Неопределено Тогда
		СинонимОбъекта = Метаданные.Отчеты.Найти(ИмяОбъекта).Синоним;
	Иначе
		СинонимОбъекта = "";
	КонецЕсли;
	Если РежимСохраненияНастройки Тогда
		ЭтаФорма.Заголовок = "Сохранение варианта настройки "; //"" + СинонимОбъекта + """";
        Элементы.Выбрать.Видимость=Ложь;
		ЭтаФорма.ТекущийЭлемент = Элементы.Наименование1;
	Иначе
		ЭтаФорма.Заголовок = "Список вариантов настройки "; //"" + СинонимОбъекта + """";
        Элементы.ФормаСохранить.Видимость=Ложь;
        Элементы.Наименование1.Видимость=Ложь;
        Элементы.ГруппаДополнительно.Видимость=Ложь;
		ЭтаФорма.ТекущийЭлемент = Элементы.СписокДанных;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СохраненныеНастройки.Наименование,
		|	СохраненныеНастройки.Представление,
		|	СохраненныеНастройки.Ссылка,
		|	СохраненныеНастройки.ТипНастройки,
		|	СохраненныеНастройки.СохранятьАвтоматически,
		|	СохраненныеНастройки.ИспользоватьПриОткрытии
		|ИЗ
		|	Справочник.СохраненныеНастройки КАК СохраненныеНастройки
		|ГДЕ
		|	(НЕ СохраненныеНастройки.ПометкаУдаления)
		|	И СохраненныеНастройки.НастраиваемыйОбъект = &НастраиваемыйОбъект
		|	И СохраненныеНастройки.ТипНастройки = &ТипНастройки
		|	И СохраненныеНастройки.Ссылка В(&Ссылка)";

	Запрос.УстановитьПараметр("НастраиваемыйОбъект", НастраиваемыйОбъект);
	Запрос.УстановитьПараметр("Ссылка", общ_СтандартныеОтчетыСервер.ПолучитьСписокДоступныхВариантов(НастраиваемыйОбъект));
	Запрос.УстановитьПараметр("ТипНастройки", ?(Найти(НастраиваемыйОбъект, "ОтчетОбъект") > 0,Перечисления.ТипыНастроек.НастройкиОтчета,Перечисления.ТипыНастроек.ПроизвольныеНастройки));

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НС = СписокДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НС,ВыборкаДетальныеЗаписи);
		СтрокаПользователи = "";
		Для Каждого СтрокаП Из ВыборкаДетальныеЗаписи.Ссылка.Пользователи Цикл
			СтрокаПользователи=СтрокаПользователи+?(СтрокаПользователи="","","; ")+Строка(СтрокаП.Пользователь);
		КонецЦикла;
		НС.Пользователи = СтрокаПользователи;
	КонецЦикла;

    Если Параметры.Свойство("Наименование") Тогда
		Наименование  = Параметры.Наименование;
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура СправочникСписокСохраненныеНастройкиВыборЗначения(Элемент,ВыбраннаяСтрока,СтандартнаяОбработка)
	
	Если Элементы.СписокДанных.ТекущиеДанные.Ссылка = ПредопределенноеЗначение("Справочник.СохраненныеНастройки.ПустаяСсылка") ИЛИ ЭтоГруппа(Элементы.СписокДанных.ТекущиеДанные.Ссылка) Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Если РежимСохраненияНастройки Тогда
		СохранитьНастройку();
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма") ИЛИ ТипЗнч(ВладелецФормы) = Тип("Форма") Тогда
		ВладелецФормы.СохраненнаяНастройка = Элементы.СписокДанных.ТекущиеДанные.Ссылка;
//		ВладелецФормы.ПрименитьНастройку();
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоГруппа(Ссылка)
	Возврат Ссылка.ЭтоГруппа;	
КонецФункции

&НаКлиенте
Процедура СправочникСписокСохраненныеНастройкиПриАктивизацииСтроки(Элемент)
	
	// Обновим поле наименование
	ТекущаяСтрока = Элементы.СписокДанных.ТекущиеДанные;
	Если ТекущаяСтрока=Неопределено ИЛИ ТекущаяСтрока.Ссылка = ПредопределенноеЗначение("Справочник.СохраненныеНастройки.ПустаяСсылка") И ПустаяСтрока(Наименование) Тогда
		Наименование = ?(Параметры.Заголовок="","Новый вариант отчета",Параметры.Заголовок);
	ИначеЕсли ТекущаяСтрока <> Неопределено Тогда
		Наименование = ТекущаяСтрока.Наименование;
		ИспользоватьПриОткрытии = ТекущаяСтрока.ИспользоватьПриОткрытии;
		СохранятьАвтоматически = ТекущаяСтрока.СохранятьАвтоматически;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьИспользоватьПриОткрытии()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СохраненныеНастройки.Ссылка
		|ИЗ
		|	Справочник.СохраненныеНастройки.Пользователи КАК СохраненныеНастройки
		|ГДЕ
		|	СохраненныеНастройки.Пользователь = &Владелец
		|	И СохраненныеНастройки.Ссылка.ТипНастройки = ЗНАЧЕНИЕ(Перечисление.ТипыНастроек."+?(Найти(НастраиваемыйОбъект, "ОтчетОбъект") > 0,"НастройкиОтчета","ПроизвольныеНастройки")+")
		|	И СохраненныеНастройки.Ссылка.НастраиваемыйОбъект = &НастраиваемыйОбъект
		|	И СохраненныеНастройки.Ссылка.ИспользоватьПриОткрытии = ИСТИНА
		|	И СохраненныеНастройки.Ссылка.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("Владелец", глЗначениеПеременной("глТекущийПользователь"));
	Запрос.УстановитьПараметр("НастраиваемыйОбъект", НастраиваемыйОбъект);

	Результат = Запрос.Выполнить();

	Возврат Не Результат.Пустой();	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьСвойствоОбъекта(Ссылка,Имя,Значение)
	НовыйЭлемент = 	Ссылка.ПолучитьОбъект();
	НовыйЭлемент[Имя] = Значение;
	НовыйЭлемент.Записать();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройку()
	
	ЕстьИспользоватьПриОткрытии = ЕстьИспользоватьПриОткрытии();	
	
	Если Элементы.СписокДанных.ТекущаяСтрока<>Неопределено Тогда
		ТекущаяСтрока = СписокДанных.НайтиПоИдентификатору(Элементы.СписокДанных.ТекущаяСтрока);
	КонецЕсли;
	Если ТекущаяСтрока <> Неопределено И Наименование = ТекущаяСтрока.Наименование Тогда
		//Если ВладелецФормы.СохраненнаяНастройка = ТекущаяСтрока Тогда
		//	// Выбрали текущую настройку. ничего не делаем
		//Иначе
		Ответ = Вопрос("Заменить существующий вариант отчета """ + Наименование + """?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			// Сохранение существующей настройки
			Если (Не ТекущаяСтрока.ИспользоватьПриОткрытии) И ИспользоватьПриОткрытии И ЕстьИспользоватьПриОткрытии Тогда 
				Ответ = Вопрос("Для данного отчета уже существует настройка с признаком ""Использовать при открытии"".
				|Продолжить запись?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
				Если Ответ = КодВозвратаДиалога.Нет Тогда
					Возврат;
				КонецЕсли;
			КонецЕсли;				
			
			Если ИспользоватьПриОткрытии <> ТекущаяСтрока.ИспользоватьПриОткрытии Тогда
				УстановитьСвойствоОбъекта(ТекущаяСтрока.Ссылка,"ИспользоватьПриОткрытии",ИспользоватьПриОткрытии);
			КонецЕсли;
			Если СохранятьАвтоматически <> ТекущаяСтрока.СохранятьАвтоматически Тогда
				УстановитьСвойствоОбъекта(ТекущаяСтрока.Ссылка,"СохранятьАвтоматически",СохранятьАвтоматически);
			КонецЕсли;
			ВладелецФормы.СохраненнаяНастройка = ТекущаяСтрока.Ссылка;
			Иначе
				Возврат;
			КонецЕсли;
		//КонецЕсли;
	Иначе
		// Создание новой настройки
		Если ИспользоватьПриОткрытии И ЕстьИспользоватьПриОткрытии Тогда 
			Ответ = Вопрос("Для данного отчета уже существует настройка с признаком ""Использовать при открытии"".
			|Продолжить запись?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Отказ = Ложь;
		НовыйЭлемент = СоздатьНастройку(Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		// Сохранение
		ВладелецФормы.СохраненнаяНастройка = НовыйЭлемент;
	КонецЕсли;
	ВладелецФормы.СохранитьНастройку();
	ВладелецФормы.Модифицированность = Ложь;
	
	Закрыть();
	
КонецПроцедуры


&НаСервере
Функция СоздатьНастройку(Отказ)
		НовыйЭлемент = Справочники.СохраненныеНастройки.СоздатьЭлемент();
		НовыйЭлемент.Наименование = Наименование;
		НовыйЭлемент.ИспользоватьПриОткрытии = ИспользоватьПриОткрытии;
		НовыйЭлемент.СохранятьАвтоматически = СохранятьАвтоматически;
		НовыйЭлемент.НастраиваемыйОбъект = НастраиваемыйОбъект;
		НовыйЭлемент.ТипНастройки = ?(Найти(НастраиваемыйОбъект, "ОтчетОбъект") > 0,Перечисления.ТипыНастроек.НастройкиОтчета,Перечисления.ТипыНастроек.ПроизвольныеНастройки);
		НовыйПользователь = НовыйЭлемент.Пользователи.Добавить();
		НовыйПользователь.Пользователь = глЗначениеПеременной("глТекущийПользователь");
		НовыйПользователь.ПравоИзменения = Истина;
		Отказ = Ложь;
		Сообщение = "";
		Если Наименование = "" Тогда 
			Отказ = Истина; 
			Сообщение = "Не заполнено наименование"; 
		КонецЕсли;
  		Если Отказ Тогда
			Сообщить("Элемент не может быть записан! " + Сообщение, СтатусСообщения.Важное);
			Возврат Неопределено;
		КонецЕсли;
		НовыйЭлемент.Записать();
КонецФункции

&НаКлиенте
Процедура ДействияФормыСохранить(Кнопка)
	
	СохранитьНастройку();
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Если Элементы.СписокДанных.ТекущиеДанные<>Неопределено Тогда
		СправочникСписокСохраненныеНастройкиВыборЗначения(Неопределено,Неопределено,Неопределено);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокДанныхВыбор(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Истина;
КонецПроцедуры
